import React from "react";
import Typography from "@mui/material/Typography";
import Box from "@mui/material/Box";
import Image from "next/image";
import pic from "@/public/32969-4-gaming-computer-free-download.png";
const AboutUs = () => {
  return (
    <Box sx={{ display: "flex", gap: 4, padding: "20px",justifyContent:"center",paddingY:"10vh" }}>
      <Box sx={{ display: "flex", flexDirection: "column", gap: 3,maxWidth:"750px" }}>
        <Typography variant="h4"> درباره مستر پی سی </Typography>
        <Typography>
          فروشگاه آنلاین مستر پی سی، یک فروشگاه تخصصی در حوزه تجهیزات و کالاهای
          دیجیتال است که از سال 1403 کار خود را با هدف ارائه‌ی خدمات اعم از فروش و
          مشاوره تخصصی کالاهای سخت افزاری، گیمینگ و شبکه آغاز کرد. شما می‌توانید
          در این فروشگاه بهترین کالاهای دیجیتال از برندهای معتبر را با بهترین
          کیفیت دریافت کنید و یا از طریق تماس با کارشناسان فروشگاه مستر پی سی، که خود
          نفرات فنی توانمند کشور هستند، سوالات و مشکلات خود در میان بگذارید.
          <br />
          فروشگاه مستر پی سی به عنوان نماینده‌ی فروش بسیاری از برندهای معتبر گیمینگ از
          قبیل ریزر٬ رپو٬ ام‌اس‌آی، ایسوس٬ لاجیتک و ... این تضمین را به شما
          می‌دهد که کالای اصیل مد نظر شما در اسرع وقت و با بهترین بسته بندی در
          اختیار شما قرار می‌گیرد.
          <br />
          در حال حاضر فروش محصولات در فروشگاه مستر پی سی هم به شکل اینترنتی و هم به
          شکل حضوری ممکن است و نحوه‌ی پرداخت برای مشتریان تهرانی هم بصورت آنلاین
          و هم بصورت پرداخت در محل قابل انجام است و همراهان عزیز شهرستانی هم می
          توانند بصورت آنلاین پرداخت خود را انجام دهند. همچنین نحوه ارسال در
          تهران بصورت پیک موتوری است و ارسال برای سایر شهرها از طریق پست و
          تیپاکس می‌باشد.
          <br />
          شما عزیزان می‌توانید از طریق شبکه‌های اجتماعی فروشگاه مستر پی سی از قبیل
          کانال تلگرام٬ صفحه‌ی اینستاگرام و آپارات از آخرین اخبار دنیای بازی و
          پشنهادهای ویژه ما آگاه شوید. همچنین می‌توانید از طریق شماره تلفن و
          02188888888 ( از ساعت ۱۰ تا ۱۸) و ایمیل ch.alireza021@gmail.com جهت
          مشاوره و یا طرح سوالات خود با کارشناسان فروشگاه در ارتباط باشید.
        </Typography>
      </Box>
      <Image src={pic} alt="" width={500} />
    </Box>
  );
};

export default AboutUs;
